In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\psungg\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\psungg\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\psungg\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\psungg\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\psungg\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

# Pandas Series

In [2]:
import pandas as pd
import numpy as np

# 01 Create Series

In [3]:
labels = ['aa','bb','cc']
my_list = [10,20,30]

arr = np.array(my_list)

d = {'a':10,'b':20,'c':30}

In [4]:
pd.Series(data = my_list)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(my_list,labels)

aa    10
bb    20
cc    30
dtype: int64

# Numpy Array to Panda Series

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [7]:
pd.Series(arr,labels)

aa    10
bb    20
cc    30
dtype: int32

# Dictionary to Panda Series

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(data = labels)

0    aa
1    bb
2    cc
dtype: object

In [10]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

# Using an Index

In [11]:
ser1 = pd.Series([1,2,3,4], index = ['USA','Germany','Italy','Japan'])

In [12]:
ser1['USA']

1

In [13]:
ser2 = pd.Series([1,2,3,4], index = ['USA','Germany','Thailand','Japan'])

In [14]:
ser1 + ser2

Germany     4.0
Italy       NaN
Japan       8.0
Thailand    NaN
USA         2.0
dtype: float64

# 02 Data Frame

In [15]:
import pandas as pd
import numpy as np

In [16]:
from numpy.random import randn
np.random.seed(101)

In [17]:
randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [18]:
df = pd.DataFrame(randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [19]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

# Selection and Indexing

In [20]:
df[['W']]

          W
A  0.302665
B -0.134841
C  0.807706
D -0.497104
E -0.116773

In [21]:
df[['W','X']]

          W         X
A  0.302665  1.693723
B -0.134841  0.390528
C  0.807706  0.072960
D -0.497104 -0.754070
E -0.116773  1.901755

In [22]:
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [23]:
type(df.W)

pandas.core.series.Series

# Remove Column

In [24]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [25]:
df.drop('Z', axis = 1)

          W         X         Y
A  0.302665  1.693723 -1.706086
B -0.134841  0.390528  0.166905
C  0.807706  0.072960  0.638787
D -0.497104 -0.754070 -0.943406
E -0.116773  1.901755  0.238127

In [26]:
df.drop('A', axis = 0)

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [27]:
df.drop('A', axis = 0, inplace = True)

In [28]:
df

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [29]:
df > 0

       W      X      Y     Z
B  False   True   True  True
C   True   True   True  True
D  False  False  False  True
E  False   True   True  True

In [30]:
df[df > 0]

          W         X         Y         Z
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [31]:
df[df > 0.2]

          W         X         Y         Z
B       NaN  0.390528       NaN       NaN
C  0.807706       NaN  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [32]:
df[df ['W'] > 0]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

In [33]:
df[df ['W'] > 0][['Y','X']]

          Y        X
C  0.638787  0.07296

In [34]:
df[(df['Z'] > 0) & (df['W'] > 0)]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

In [35]:
pd

In [36]:
newid = 'CA NY WY OR CO'.split()

In [37]:
df =  pd.DataFrame(randn(5,4), index = newid , columns = 'W X Y Z'.split())

In [38]:
df

           W         X         Y         Z
CA -0.993263  0.196800 -1.136645  0.000366
NY  1.025984 -0.156598 -0.031579  0.649826
WY  2.154846 -0.610259 -0.755325 -0.346419
OR  0.147027 -0.479448  0.558769  1.024810
CO -0.925874  1.862864 -1.133817  0.610478

In [39]:
df.reset_index()

  index         W         X         Y         Z
0    CA -0.993263  0.196800 -1.136645  0.000366
1    NY  1.025984 -0.156598 -0.031579  0.649826
2    WY  2.154846 -0.610259 -0.755325 -0.346419
3    OR  0.147027 -0.479448  0.558769  1.024810
4    CO -0.925874  1.862864 -1.133817  0.610478

In [40]:
df['States'] = newid

In [41]:
df

           W         X         Y         Z States
CA -0.993263  0.196800 -1.136645  0.000366     CA
NY  1.025984 -0.156598 -0.031579  0.649826     NY
WY  2.154846 -0.610259 -0.755325 -0.346419     WY
OR  0.147027 -0.479448  0.558769  1.024810     OR
CO -0.925874  1.862864 -1.133817  0.610478     CO

In [42]:
df.set_index('States')

               W         X         Y         Z
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
WY      2.154846 -0.610259 -0.755325 -0.346419
OR      0.147027 -0.479448  0.558769  1.024810
CO     -0.925874  1.862864 -1.133817  0.610478

In [43]:
df

           W         X         Y         Z States
CA -0.993263  0.196800 -1.136645  0.000366     CA
NY  1.025984 -0.156598 -0.031579  0.649826     NY
WY  2.154846 -0.610259 -0.755325 -0.346419     WY
OR  0.147027 -0.479448  0.558769  1.024810     OR
CO -0.925874  1.862864 -1.133817  0.610478     CO

In [44]:
df.set_index('States', inplace = True)

In [45]:
df

               W         X         Y         Z
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
WY      2.154846 -0.610259 -0.755325 -0.346419
OR      0.147027 -0.479448  0.558769  1.024810
CO     -0.925874  1.862864 -1.133817  0.610478

# Multi Index

# Index Level

In [46]:
outside = ['G1','G1','G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [47]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [48]:
df = pd.DataFrame(np.random.rand(6,2), index = hier_index, columns = ['A','B'])

In [49]:
df

             A         B
G1 1  0.659925  0.529623
   2  0.748520  0.093757
   3  0.784522  0.687242
G2 1  0.695078  0.496867
   2  0.975361  0.203528
   3  0.299020  0.227656

In [50]:
df.loc['G1']

          A         B
1  0.659925  0.529623
2  0.748520  0.093757
3  0.784522  0.687242

In [51]:
df.loc['G2'].loc[1]

A    0.695078
B    0.496867
Name: 1, dtype: float64

In [52]:
df.index.names

FrozenList([None, None])

In [53]:
df.index.names = ['Group', 'Num']

In [54]:
df.index.names

FrozenList(['Group', 'Num'])

In [63]:
df

                  A         B
Group Num
G1    1    0.659925  0.529623
      2    0.748520  0.093757
      3    0.784522  0.687242
G2    1    0.695078  0.496867
      2    0.975361  0.203528
      3    0.299020  0.227656

In [64]:
df.xs('G1')

            A         B
Num
1    0.659925  0.529623
2    0.748520  0.093757
3    0.784522  0.687242

In [65]:
df.xs(['G1',1])

C:\Users\Psungg\AppData\Local\Temp\ipykernel_24684\580597333.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',1])

A    0.659925
B    0.529623
Name: (G1, 1), dtype: float64

                  A         B
Group Num
G1    1    0.659925  0.529623
      2    0.748520  0.093757
      3    0.784522  0.687242
G2    1    0.695078  0.496867
      2    0.975361  0.203528
      3    0.299020  0.227656

# Selecting Row

In [66]:
df.loc['C']

KeyError: 'C'

# Selecting Column

In [67]:
df.iloc[2]

A    0.784522
B    0.687242
Name: (G1, 3), dtype: float64

In [68]:
df.loc['B','Y']

KeyError: 'B'

In [81]:
df.loc[['D','E'],['Y','Z']]

KeyError: "None of [Index(['D', 'E'], dtype='object')] are in the [index]"

In [ ]:
df.xs(1, level = 'Num')

# 02 Missing Data

In [70]:
import pandas as pd
import numpy as np

In [71]:
#Dict to Dataframe

In [72]:
df = pd.DataFrame({'A':[1,2,np.nan],
                   'B':[5,np.nan,np.nan],
                   'C':[1,2,3]})

In [73]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [74]:
df.dropna() #only ccompleted row

     A    B  C
0  1.0  5.0  1

In [77]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [78]:
df.dropna(thresh = 2) #threshhold

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [79]:
df.fillna(value = 'Fill Value')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [80]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# 03 Group by

In [82]:
import pandas as pd

In [83]:
data = {'Company':['SCG','SCG','PTT','PTT','KTB','KTB'],
       'Person':['Somsri','Charlie','Somchai','Kaew','Noo','Sarah'],
       'Sales' :[200,120,340,124,243,350]}

In [84]:
data

{'Company': ['SCG', 'SCG', 'PTT', 'PTT', 'KTB', 'KTB'],
 'Person': ['Somsri', 'Charlie', 'Somchai', 'Kaew', 'Noo', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [85]:
df = pd.DataFrame(data)

In [86]:
df

  Company   Person  Sales
0     SCG   Somsri    200
1     SCG  Charlie    120
2     PTT  Somchai    340
3     PTT     Kaew    124
4     KTB      Noo    243
5     KTB    Sarah    350

In [87]:
df.groupby('Company')

In [88]:
by_comp = df.groupby('Company')

In [89]:
by_comp.mean()

C:\Users\Psungg\AppData\Local\Temp\ipykernel_24684\821838057.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_comp.mean()

         Sales
Company
KTB      296.5
PTT      232.0
SCG      160.0

In [90]:
by_comp.std()

C:\Users\Psungg\AppData\Local\Temp\ipykernel_24684\3391457442.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_comp.std()

              Sales
Company
KTB       75.660426
PTT      152.735065
SCG       56.568542

In [91]:
by_comp.min()

          Person  Sales
Company
KTB          Noo    243
PTT         Kaew    124
SCG      Charlie    120

In [92]:
by_comp.max()

          Person  Sales
Company
KTB        Sarah    350
PTT      Somchai    340
SCG       Somsri    200

In [93]:
by_comp.count()

         Person  Sales
Company
KTB           2      2
PTT           2      2
SCG           2      2

In [94]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
KTB       2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
PTT       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
SCG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0

In [95]:
by_comp.describe().transpose()

Company             KTB         PTT         SCG
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  232.000000  160.000000
      std     75.660426  152.735065   56.568542
      min    243.000000  124.000000  120.000000
      25%    269.750000  178.000000  140.000000
      50%    296.500000  232.000000  160.000000
      75%    323.250000  286.000000  180.000000
      max    350.000000  340.000000  200.000000

In [96]:
by_comp.describe().transpose()['PTT']

Sales  count      2.000000
       mean     232.000000
       std      152.735065
       min      124.000000
       25%      178.000000
       50%      232.000000
       75%      286.000000
       max      340.000000
Name: PTT, dtype: float64

# 04 Merging, Joining, and Concatenating

In [97]:
import pandas as pd

In [98]:
df1 = pd.DataFrame({'A': ['A0','A1','A2','A3'],
                   'B' : ['B0','B1','B2','B3'],
                   'C' : ['C0','C1','C2','C3'],
                   'D' : ['D0','D1','D2','D3']},
                   index = [0,1,2,3])

In [99]:
df2 = pd.DataFrame({'A' : ['A4','A5','A6','A7'],
                   'B' : ['B4','B5','B6','B7'],
                   'C' : ['C4','C5','C6','C7'],
                   'D' : ['D4','D5','D6','D7']},
                  index = [4,5,6,7])

In [100]:
df3 = pd.DataFrame({'A': ['A8','A9','A10','A11'],
                   'B' : ['B8','B9','B10','B11'],
                   'C' : ['C8','C9','C10','C11']},
                  index = [8,9,10,11])

In [101]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [102]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [103]:
df3

      A    B    C
8    A8   B8   C8
9    A9   B9   C9
10  A10  B10  C10
11  A11  B11  C11

# Concatenate

In [104]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8  NaN
9    A9   B9   C9  NaN
10  A10  B10  C10  NaN
11  A11  B11  C11  NaN

In [105]:
pd.concat([df1,df2,df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11

In [106]:
left = pd.DataFrame({'key' : ['K0','K1','K2','K3'],
                    'A' : ['A0','A1','A2','A3'],
                    'B' : ['B0','B2','B3','B3']})

In [107]:
right = pd.DataFrame({'key' : ['K0','K1','K2','K3'],
                     'C' : ['C0','C1','C2','C3'],
                     'D' : ['D0','D1','D2','D3']})

In [108]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B2
2  K2  A2  B3
3  K3  A3  B3

In [109]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [110]:
pd.merge(left,right, how = 'inner', on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B2  C1  D1
2  K2  A2  B3  C2  D2
3  K3  A3  B3  C3  D3

In [111]:
left = pd.DataFrame({'key1' : ['K0','K0','K1','K2'],
                    'key2' : ['K0','K1','K0','K1'],
                    'A' : ['A0','A1','A2','A3'],
                    'B' : ['B0','B1','B2','B3']})

In [112]:
right = pd.DataFrame({'key1' : ['K0','K1','K1','K2'],
                     'key2' : ['K0','K0','K0','K0'],
                     'C' : ['C0','C1','C2','C3'],
                     'D' : ['D0','D1','D2','D3']})

In [113]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [114]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

# Innner

In [115]:
pd.merge(left,right, on = ['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

# Outer or union

In [116]:
pd.merge(left,right, how = 'outer', on = ['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

# Right

In [117]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [118]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [119]:
pd.merge(left,right, how = 'right' ,  on = ['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

# left

In [120]:
pd.merge(left,right, how = 'left', on = ['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

# joining

In [121]:
left = pd.DataFrame({'A' : ['A0','A1','A2'],
                    'B' : ['B0','B1','B2']},
                    index = ['K0','K1','K2'])

In [122]:
right = pd.DataFrame({'C' : ['C0','C2','C3'],
                     'D' : ['D0','D2','D3']},
                    index = ['K0','K1','K3'])

In [123]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [124]:
right

     C   D
K0  C0  D0
K1  C2  D2
K3  C3  D3

In [125]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1   C2   D2
K2  A2  B2  NaN  NaN

In [126]:
left.join(right, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1   C2   D2
K2   A2   B2  NaN  NaN
K3  NaN  NaN   C3   D3

# Operation

In [127]:
import pandas as pd

In [128]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [129]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [130]:
df['col2']

0    444
1    555
2    666
3    444
Name: col2, dtype: int64

In [131]:
df['col2'].unique() #numpy array

array([444, 555, 666], dtype=int64)

In [132]:
df['col2'].nunique() #Show number of member

3

In [133]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [142]:
#Data Selection

In [143]:
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [144]:
newdf

   col1  col2 col3
3     4   444  xyz

In [145]:
#Applying Function

In [146]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [147]:
def times5(x):
    return x*5

In [148]:
df['col1'].apply(times5)

0     5
1    10
2    15
3    20
Name: col1, dtype: int64

In [149]:
df['col3']

0    abc
1    def
2    ghi
3    xyz
Name: col3, dtype: object

In [150]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [151]:
df['col1'].sum()

10

In [152]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [153]:
#Delete Permanently

In [154]:
del df['col1']

In [155]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [156]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [157]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [158]:
#Sorting

In [159]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [160]:
df.sort_values(by = 'col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [161]:
#Null

In [162]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [163]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [164]:
import numpy as np

In [165]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                  'col2':[np.nan,555,666,444],
                  'col3':['abc','def','ghi','xyz']})

In [166]:
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [167]:
df.fillna('FILL')

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

In [168]:
#Ordering

In [169]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
       'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,2,3,5,4,1]}

In [170]:
data

{'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
 'B': ['one', 'one', 'two', 'two', 'one', 'one'],
 'C': ['x', 'y', 'x', 'y', 'x', 'y'],
 'D': [1, 2, 3, 5, 4, 1]}

In [171]:
df = pd.DataFrame(data)

In [172]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  2
2  foo  two  x  3
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [173]:
df.pivot_table(values = 'D', index = ['A'], columns = ['C'])

C    x  y
A
bar  4  3
foo  2  2

# 04 Data Input and Output

In [1]:
import numpy as np
import pandas as pd

In [2]:
#CSV

In [3]:
df = pd.read_csv('example')

In [4]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
df.to_csv('example_out', index = False)

In [6]:
#Import Excel

In [7]:
pd.read_excel('Excel_Sample.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [8]:
#Output Excel

In [9]:
df.to_excel('Excel_out.xlsx')

In [10]:
#HTML

In [11]:
#install lxml
#install html5lib
#install BeautifulSoup4

In [ ]:
pip install lxml

In [ ]:
pip install html5lib

In [ ]:
pip install BeautifulSoup4

In [41]:
data_html = pd.read_html("https://www.set.or.th/en/market/product/stock/overview")

In [42]:
data_html[0]

,Index,Last,Change,Open,High,Low,Volume ('000 Shares),Value (M.Baht)
0,SET,1528.81,+9.25 (+0.61%),1515.10,1531.08,1512.08,14113457,53040.89
1,SET50,944.29,+5.41 (+0.58%),934.76,945.97,932.52,1365358,30535.27
2,SET100,2092.52,+13.07 (+0.63%),2071.64,2095.93,2066.89,2480570,41625.74
3,sSET,931.19,+9.98 (+1.08%),921.86,932.52,921.26,717446,3585.46
4,SETCLMV,894.46,+9.57 (+1.08%),885.24,897.05,885.24,625732,19073.68
5,SETHD,1159.22,+4.87 (+0.42%),1150.26,1162.89,1149.02,1332100,11882.68
6,SETTHSI,991.21,+4.72 (+0.48%),982.29,992.85,980.15,1987967,32979.31
7,SETWB,907.05,+10.96 (+1.22%),896.50,908.62,895.40,502947,12531.72
8,mai,459.95,+5.57 (+1.23%),453.89,461.14,453.68,543310,1596.60